# FabricationDoublewallMaterialAbbreviation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricationDoublewallMaterialAbbreviation Property
ParameterTypeId Class See Also
---
"Double Wall Material Abbreviation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricationDoublewallMaterialAbbreviation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationDoublewallMaterialAbbreviation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricationDoublewallMaterialAbbreviation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace